In [3]:
import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df.isnull().sum()

AAPL    6
dtype: int64

In [10]:
import pandas as pd
import numpy as np

daily_returns = pd.DataFrame({"AAPL":[0.5, np.nan, 0.62],
                            "GOOG":[0.45,0.63,0.55]})
#daily_returns
#daily_returns.dropna()

#daily_returns = daily_returns.fillna("unknown")
#daily_returns = daily_returns.fillna(0)
daily_returns = daily_returns.fillna(daily_returns.mean())
daily_returns

   AAPL  GOOG
0  0.50  0.45
1  0.56  0.63
2  0.62  0.55

In [17]:
import pandas as pd

best_actor_df= pd.DataFrame({"best actor":["Nic Cage", "Nic Cage", "Harrison Ford"]})

#best_actor_df

#best_actor_df.duplicated().sum()

best_actor_df=best_actor_df.drop_duplicates()

best_actor_df

      best actor
0       Nic Cage
2  Harrison Ford

In [39]:
import pandas as pd

currency_df = pd.DataFrame({"price_usd":["$0.53","$0.22","0.34"]})

currency_df.loc[:,"price_usd"] = currency_df.loc[:,"price_usd"].str.replace("$","")

currency_df.loc[:,"price_usd"] = currency_df.loc[:,"price_usd"].astype("float")

currency_df.sum()

#currency_df.dtypes

C:\Users\Admin\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  """

price_usd    1.09
dtype: float64

In [41]:
import pandas as pd

goog_df = pd.DataFrame({"AAPL": [1045.85, 1070.08, 1140.99, 1113.65, 1193.32, 1231.54, 1215.00, 1207.15,1248.84, 1166.27, 1138.85, 1003.63, 1080.91]})

goog_df.describe()

              AAPL
count    13.000000
mean   1142.775385
std      76.556568
min    1003.630000
25%    1080.910000
50%    1140.990000
75%    1207.150000
max    1248.840000

In [87]:
import pandas as pd

aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1, 0.75, 0.47]})

aapl_returns.iloc[0]

AAPL    0.5
Name: 0, dtype: float64

In [61]:
import numpy as np
revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000),
    index=pd.date_range('1/1/2017', periods=1000),
    columns=["revenue"])
revenue_df.tail()

            revenue
2019-09-23      556
2019-09-24      672
2019-09-25      136
2019-09-26      910
2019-09-27      773

In [63]:
# Select the last quarter of 2018 to the first quarter of 2019
revenue_df.loc['2018-10-01':'2019-03-31'].describe()

          revenue
count  182.000000
mean   503.532967
std    284.933522
min      3.000000
25%    249.250000
50%    497.000000
75%    741.500000
max    995.000000

In [64]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [73]:
sales_df.loc[(sales_df["quantity"]>10) | (sales_df["total_price"]<45)]

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [67]:
filter=sales_df["quantity"]>10
sales_df.loc[filter]

       item  quantity  total_price
0  tomatoes        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

In [76]:
sales_tot_min = sales_df["total_price"].min()

sales_tot_min_row=sales_df.loc[sales_df["total_price"] == sales_tot_min]
sales_tot_min_row

        item  quantity  total_price
4  mushrooms         2         8.46

In [77]:
sales_tot_max = sales_df["total_price"].max()

sales_tot_max_row=sales_df.loc[sales_df["total_price"] == sales_tot_max]
sales_tot_max_row

       item  quantity  total_price
0  tomatoes        15        50.25

In [79]:
sales_df.loc[sales_df["item"] == "tomatoes", ["total_price"]].mean()

total_price    45.225
dtype: float64

In [80]:
sales_df.iloc[0:3,[0,2]]

       item  total_price
0  tomatoes        50.25
1    onions        39.52
2  potatoes        50.01

In [82]:
sales_df.loc[sales_df["item"]=="tomatoes",["quantity","total_price"]]

   quantity  total_price
0        15        50.25
3        12        40.20

In [83]:
sales_df.loc[:,["item","total_price"]]

        item  total_price
0   tomatoes        50.25
1     onions        39.52
2   potatoes        50.01
3   tomatoes        40.20
4  mushrooms         8.46

In [86]:
sales_df.sort_values(["total_price","quantity"],ascending=False)

        item  quantity  total_price
0   tomatoes        15        50.25
2   potatoes        10        50.01
3   tomatoes        12        40.20
1     onions        26        39.52
4  mushrooms         2         8.46

In [88]:
sales_df = pd.DataFrame({
    "item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms", "potatoes", "onions", "tomatoes", "onions", "tomatoes"],
    "store": ["Downtown", "Downtown", "Midtown", "Midtown", "Downtown", "Midtown", "Downtown", "Midtown", "Midtown", "Midtown"],
    "quantity": [15, 26, 10, 12, 2, 3, 17, 16, 20, 9],
    "total_price": [50.25, 39.52, 50.10, 40.20, 8.46, 15.03, 25.84, 53.60, 30.40, 30.15]})
sales_df

        item     store  quantity  total_price
0   tomatoes  Downtown        15        50.25
1     onions  Downtown        26        39.52
2   potatoes   Midtown        10        50.10
3   tomatoes   Midtown        12        40.20
4  mushrooms  Downtown         2         8.46
5   potatoes   Midtown         3        15.03
6     onions  Downtown        17        25.84
7   tomatoes   Midtown        16        53.60
8     onions   Midtown        20        30.40
9   tomatoes   Midtown         9        30.15

In [97]:
item_grp_df = sales_df.groupby(["item","store"])
item_grp_df.max()

                    quantity  total_price
item      store
mushrooms Downtown         2         8.46
onions    Downtown        26        39.52
          Midtown         20        30.40
potatoes  Midtown         10        50.10
tomatoes  Downtown        15        50.25
          Midtown         16        53.60